---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceBrowserData.ServerId
source: html/de683377-f59a-80ee-55e0-cc9be601eaba.htm
---
# Autodesk.Revit.DB.ExternalResourceBrowserData.ServerId Property

The Id of IExternalResourceServer which handles the external resource load.

## Syntax (C#)
```csharp
public Guid ServerId { get; }
```